Repository: common-repository/nutsforpress-login-watchdog
Catalog: languages/nutsforpress-login-watchdog-*.po
Languages: it_it

source: Role changed in
it_it: Ruolo modificato in

source: A user, with user login
it_it: Un visitatore, con nome utente

source: has now
it_it: ha ora

source: role
it_it: ruolo

source: Successful login to
it_it: Accesso riuscito a

source: You've just logged in to
it_it: Hai appena effettuato l'accesso a

source: If you do not recognize this action as your own, go to your profile page
it_it: Se non riconosci questa azione come tua, vai al tuo profilo

source: and immediately change your password using the "Generate Password" button, then click on the "Log Out Everywhere Else" button
it_it: e cambia immediatamente la tua password utilizzando il pulsante "Imposta nuova password", poi fai clic sul pulsante "Scollegati da ogni postazione"

source: Plugin activation on
it_it: Attivazione del plugin su

source: The plugin
it_it: Il plugin

source: has just been activated on
it_it: è stato appena attivato su

source: User deleted in
it_it: Utente cancellato in

source: An administrator, with user login
it_it: Un amministratore, con nome utente

source: was just deleted from
it_it: è stato appena cancellato da

source: The user with administrative role
it_it: L'utente con ruolo amministrativo

source: logged in successfully to
it_it: ha effettuato l'accesso a

source: attempts
it_it: tentativi

source: minutes
it_it: minuti

source: hours
it_it: ore

source: days
it_it: giorni

source: unlimited (never locked)
it_it: illimitati (mai bloccato)

source: after
it_it: dopo

source: lock downs
it_it: blocchi

source: users permanently locked
it_it: utenti bloccati in modo permanente

source: browse one of your frontend page and get back to see the results
it_it: naviga una delle tue pagine di frontend e torna qui per vedere i risultati

source: no checks so far
it_it: nessun controllo finora

source: Two factors authentication for Administrators
it_it: Autenticazione a due fattori per gli Amministratori

source: If switched on, Administrators are required to confirm their authentication by following the instructions contained into an email message sent each time they login successfully
it_it: Se attivata, gli amministratori sono tenuti a confermare la loro autenticazione seguendo le istruzioni contenute in un messaggio di posta elettronica inviato ogni volta che effettuano con successo il login

source: Skip two factors authentication until IP does not change
it_it: Salta l'autenticazione a due fattori finché l'IP non cambia

source: If switched on, two factors authentication is skipped when IP has not changed since the last successful login
it_it: Se attivata, l'autenticazione a due fattori viene saltata quando l'IP non è cambiato dall'ultimo accesso riuscito

source: Login attempts tracking
it_it: Monitoraggio dei tentativi di accesso

source: If switched on, login attempts will be tracked and user exceeding the allowed login attempts will be suspended or excluded from login
it_it: Se attivata, i tentativi di accesso verranno monitorati e l'utente che supera i tentativi di accesso consentiti verrà sospeso o escluso dall'accesso

source: Allowed failed login attempts
it_it: Tentativi di accesso non riusciti consentiti

source: Define how many times a user can be fail on login before being temporarily prevented from trying again
it_it: Definire quante volte un utente può fallire l'accesso prima che gli venga temporaneamente impedito di riprovare

source: Inform user about attempts left
it_it: Informa l'utente dei tentativi rimasti

source: After a failed login attempt, display a message for notifying the user about login attempts left
it_it: Dopo un tentativo di accesso non riuscito, visualizzare un messaggio per notificare all'utente i tentativi di accesso rimasti

source: Temporary lock duration
it_it: Durata del blocco temporaneo

source: Define how long a user that exceeded conceded login attempts has to wait before retrying
it_it: Definire per quanto tempo un utente che ha superato i tentativi di accesso concessi deve attendere prima di riprovare

source: Temporary lock down message
it_it: Messaggio di blocco temporaneo

source: Message to be displayed when someone exceeds the maximum number of login attempts conceded
it_it: Messaggio da visualizzare quando qualcuno supera il numero massimo di tentativi di accesso concessi

source: You have exceeded the maximum number of login attempts conceded, please try again later
it_it: Hai superato il numero massimo di tentativi di accesso concessi, riprova più tardi

source: Permanently lock
it_it: Blocco permanente

source: Define how many times a user can be temporarily locked down before being permanently prevented from login
it_it: Definire quante volte un utente può essere temporaneamente bloccato prima di che gli venga definitivamente impedito l'accesso

source: Permanent lock down message
it_it: Messaggio di blocco permanente

source: Message to be displayed when someone gets permanently locked down
it_it: Messaggio da visualizzare quando qualcuno viene bloccato in modo permanente

source: Sorry, you can not try to login anymore since you are permanently locked down
it_it: Siamo spiacenti, non puoi più provare ad accedere poiché sei bloccato in modo permanente

source: Deactivate XML-RPC
it_it: Disattiva XML-RPC

source: If switched on, the WordPress support for XML-RPC protocol, often used for brute force attacks, will be deactivated
it_it: Se attivata, il supporto WordPress per il protocollo XML-RPC, spesso utilizzato per gli attacchi di forza bruta, verrà disattivato

source: Prevent author usernames from being discovered
it_it: Impedisci che gli username possano essere scoperti

source: If switched on, some WordPress native functions that help hackers to have access to authors usernames, including the ones with administrative privileges, will be deactivated
it_it: Se attivata, alcune funzioni native di WordPress che aiutano gli hacker ad avere accesso ai nomi utente degli autori, inclusi quelli con privilegi amministrativi, verranno disattivate

source: Prevent automatic redirection to author page
it_it: Impedisci il reindirizzamento automatico alla pagina dell'autore

source: If switched on, an author archive page called by an ID parameter, for example %s, will be redirected to home URL through a WordPress safe redirection
it_it: Se attivata, una pagina di archivio dell'autore chiamata da un parametro ID, ad esempio %s, verrà reindirizzata all'URL principale tramite un reindirizzamento sicuro di WordPress

source: yours
it_it: la tua

source: Hide username access through API REST
it_it: Impedisci l'accesso al nome utente tramite API REST

source: If switched on, you will prevent usernames to be discovered through %s
it_it: Se attivata, impedirai che i nomi utente siano scoperti tramite %s

source: Custom login errors
it_it: Errori di autenticazione personalizzati

source: If switched on, the defined custom login errors will be displayed instead of the ones from WordPress
it_it: Se attivata, verranno visualizzati gli errori di accesso personalizzati qui definiti invece di quelli di WordPress

source: Message to display when username is not valid
it_it: Messaggio da visualizzare quando il nome utente non è valido

source: Enter the message that you want to be displayed on wrong username
it_it: Immettere il messaggio che si desidera visualizzare con nome utente errato

source: User not found, please retry
it_it: Utente non trovato, per favore riprova

source: Message to display when email address is not valid
it_it: Messaggio da visualizzare quando l'indirizzo email non è valido

source: Enter the message that you want to be displayed on wrong email address
it_it: Immettere il messaggio che si desidera visualizzare quando l'indirizzo email è errato

source: Message to display when password is not valid
it_it: Messaggio da visualizzare quando la password non è valida

source: Enter the message that you want to be displayed on wrong password
it_it: Immettere il messaggio che si desidera visualizzare quando la password errata

source: Message to display when username is empty
it_it: Messaggio da visualizzare quando il nome utente è vuoto

source: Enter the message that you want to be displayed on empty username
it_it: Immettere il messaggio che si desidera visualizzare quando il nome utente è vuoto

source: Please, fill-in all the required data
it_it: Per favore, compila tutti i dati richiesti

source: Message to display when password is empty
it_it: Messaggio da visualizzare quando la password è vuota

source: Enter the message that you want to be displayed on empty password
it_it: Immettere il messaggio che si desidera visualizzare quando la password è vuota

source: Notifications
it_it: Notifiche

source: If switched on, the notifications defined here will be sent to the entered address
it_it: Se attivata, le notifiche qui definite verranno inviate all'indirizzo inserito

source: On administrator successful login
it_it: Quando un amministratore effettua il login con successo

source: If switched on, a notification will be sent when a user with administrative role logs in successfully
it_it: Se attivata, viene inviata una notifica quando un utente con ruolo amministrativo effettua il login con successo

source: On role change
it_it: Al cambio di ruolo

source: If switched on, a notification will be sent when a user role is changed
it_it: Se attivata, verrà inviata una notifica quando un ruolo utente viene modificato

source: On administrator delete
it_it: Quando un amministratore viene cancellato

source: If switched on, a notification will be sent when an administrator is deleted
it_it: Se attivata, verrà inviata una notifica quando un amministratore viene cancellato

source: On temporary lock
it_it: Al blocco temporaneo

source: If switched on and if login attempts tracking is enabled, a notification will be sent when a user is temporary locked down
it_it: Se attivato e se il monitoraggio dei tentativi di accesso è abilitato, verrà inviata una notifica quando un utente è temporaneamente bloccato

source: On permanent lock
it_it: Al blocco permanente

source: If switched on and if login attempts tracking is enabled, a notification will be sent when a user is permanently locked down
it_it: Se attivato e se il monitoraggio dei tentativi di accesso è abilitato, verrà inviata una notifica quando un utente viene bloccato in modo permanente

source: On a plugin activation
it_it: All'attivazione di un plugin

source: If switched on, a notification will be sent when a plugin is activated
it_it: Se attivata, verrà inviata una notifica quando viene attivato un plugin

source: When suspect files are found
it_it: Quando vengono trovati dei file sospetti

source: If switched on, a notification will be sent when the daily security check will find suspect files
it_it: Se attivata, verrà inviata una notifica quando il controllo di sicurezza giornaliero troverà file sospetti

source: Last security check
it_it: Ultimo controllo di sicurezza

source: If you want to manually run the security check now and you wish to be notified by email about results, even if no suspect files are found, %s
it_it: Se vuoi eseguire manualmente il controllo di sicurezza e desideri ricevere una notifica via e-mail dei risultati, anche se non vengono individuati file sospetti, %s

source: run the security check now
it_it: esegui ora il controllo di sicurezza

source: click here
it_it: clicca qui

source: Notification address
it_it: Indirizzo di notifica

source: Enter the email address to be used for all the above notifications
it_it: Inserisci l'indirizzo email da utilizzare per tutte le notifiche di cui sopra

source: Notify administrator on successful login
it_it: Avvisa l'amministratore quando si autentica con successo

source: If switched on, a notification will be sent to the administrator who logs in successfully
it_it: Se attivata, verrà inviata una notifica all'amministratore che si autentica con successo

source: not completed, an error occurred
it_it: non completato, un errore è stato registrato

source: Error on security check
it_it: Errore nel controllo di sicurezza

source: The daily security check failed on
it_it: Il controllo di sicurezza giornaliero è fallito su

source: some suspect files found, please investigate
it_it: sono stati trovati alcuni file sospetti, si prega di indagare

source: These files are different from the ones included in the original WordPress package
it_it: Questi file sono diversi da quelli inclusi nel pacchetto originale di WordPress

source: and furthermore they hide some unexpected PHP code
it_it: e inoltre nascondono del codice PHP inatteso

source: These files, not a part of the original WordPress package
it_it: Questi file, che non fanno parte del pacchetto originale di WordPress

source: hide some unexpected PHP code
it_it: nascondono del codice PHP inatteso

source: These files are not a part of the original WordPress package
it_it: Questi file non fanno parte del pacchetto originale di WordPress

source: some of them may turn out to be false positives
it_it: alcuni di essi potrebbero rivelarsi falsi positivi

source: Suspect files on
it_it: File sospetti su

source: The daily security check on
it_it: Il controllo di sicurezza giornaliero su

source: has find that the following files are to be considered as suspect for the following reasons
it_it: ha riscontrato che i seguenti file devono essere considerati sospetti per le seguenti ragioni

source: It is very likely that this list is not complete, since some primary folders are not inspected at all (wp-content, just to name one); therefore this e-mail message is intended to be an alert for an existing infection, which should be adequately investigated with appropriate tools
it_it: È molto probabile che questo elenco non sia completo, dato che alcune cartelle primarie non vengono affatto ispezionate (wp-content, solo per citarne una); pertanto questo messaggio di posta elettronica è da intendersi come un'allerta per un'infezione esistente, che dovrebbe essere adeguatamente indagata con strumenti appropriati

source: no suspect files found, so far so good
it_it: non sono stati trovati file sospetti, per ora tutto bene

source: No suspect files on
it_it: Nessun file sospetto su

source: The manually security check on
it_it: Il controllo di sicurezza manuale su

source: has find that no files are to be considered as suspect
it_it: ha riscontrato che nessun file è da considerarsi sospetto

source: Be careful
it_it: Fai attenzione

source: you have only
it_it: hai solo

source: attempts left
it_it: tentativi a disposizione

source: User permanently locked down from
it_it: L'utente è stato bloccato in modo permanente da

source: A user was permanently locked for having exceeded temporary locks conceded
it_it: Un utente è stato bloccato in modo permanente per aver superato i blocchi temporanei concessi

source: Last username used was
it_it: L'ultimo nome utente utilizzato è stato

source: Anonymized user IP is
it_it: L'IP utente anonimizzato è

source: User locked down from
it_it: Utente bloccato su

source: A user was temporarily locked for having exceeded login attempts conceded
it_it: Un utente è stato temporaneamente bloccato per aver superato i tentativi di accesso concessi

source: Enter the code received by email
it_it: Inserisci il codice ricevuto via email

source: The provided code is not valid
it_it: Il codice fornito non è valido

source: Your login code is
it_it: Il tuo codice di accesso è

source: Howdy
it_it: Ciao

source: in order to confirm your authentication, please enter the below code within the next ten minutes
it_it: per confermare l'autenticazione, inserisci il codice qui sotto entro i prossimi dieci minuti

source: Login code
it_it: Codice di accesso

source: If you are not trying to login to
it_it: Se non stai provando ad accedere a

source: it is strongly recommended that you change your password, since someone knows it
it_it: è fortemente raccomandato che tu cambi la tua password, dal momento che qualcuno ne è in possesso

source: Thank you
it_it: Grazie
